In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {"Make":['Nissan','Hyundai','Lotus','GMC','Nissan'],
       "Model":['Stanza','Sonata','Elise','Acadia','Frontier'],
       "Year":[1991,2017,2010,2017,2017],
       "Engine HP": [138, None, 218, 194, 2017],
       "Engine Cylinders":[4,4,4,4,6],
       "Transmission Type":['MANUAL','AUTOMATIC','MANUAL','AUTOMATIC','MANUAL'],
       "Vehicle_Style":['sedan','sedan','convertible','4dr SUV','Pickup'],
       "MSRP":[2000,27150,54990,34450,32340]}

In [4]:
df = pd.DataFrame(data)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,2017.0,6,MANUAL,Pickup,32340

In [5]:
df.head(2)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,sedan,27150

In [13]:
df[['Make','Model','Year']]

      Make     Model  Year
0   Nissan    Stanza  1991
1  Hyundai    Sonata  2017
2    Lotus     Elise  2010
3      GMC    Acadia  2017
4   Nissan  Frontier  2017

In [14]:
df['id'] = [1,2,3,4,5]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,sedan,27150,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
4,Nissan,Frontier,2017,2017.0,6,MANUAL,Pickup,32340,5

In [15]:
del df['id']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,2017.0,6,MANUAL,Pickup,32340

In [16]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
df.Make.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
df.columns

Index(['Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Vehicle_Style', 'MSRP'],
      dtype='object')

In [21]:
# iloc is row based
df.iloc[0]

Make                 Nissan
Model                Stanza
Year                   1991
Engine HP             138.0
Engine Cylinders          4
Transmission Type    MANUAL
Vehicle_Style         sedan
MSRP                   2000
Name: 0, dtype: object

In [22]:
df.iloc[[2,3,0]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000

In [24]:
df[['Model']]

      Model
0    Stanza
1    Sonata
2     Elise
3    Acadia
4  Frontier

In [25]:
df['Year'] > 2000

0    False
1     True
2     True
3     True
4     True
Name: Year, dtype: bool

In [26]:
df['Make'] == 'Nissan'

0     True
1    False
2    False
3    False
4     True
Name: Make, dtype: bool

In [27]:
(df['Year'] > 2000) & (df['Make'] == 'Nissan')

0    False
1    False
2    False
3    False
4     True
dtype: bool

### Filtering

In [28]:
df[df['Make'] == 'Nissan']

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
4,Nissan,Frontier,2017,2017.0,6,MANUAL,Pickup,32340

In [29]:
df[(df['Year'] > 2000) & (df['Transmission Type'] == 'AUTOMATIC')]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450

### String Operations

In [30]:
df['Vehicle_Style'].str.replace(' ','_')

0          sedan
1          sedan
2    convertible
3        4dr_SUV
4         Pickup
Name: Vehicle_Style, dtype: object

In [31]:
df.columns.str.lower().str.replace(' ','_')

Index(['make', 'model', 'year', 'engine_hp', 'engine_cylinders',
       'transmission_type', 'vehicle_style', 'msrp'],
      dtype='object')

In [32]:
df.dtypes

Make                  object
Model                 object
Year                   int64
Engine HP            float64
Engine Cylinders       int64
Transmission Type     object
Vehicle_Style         object
MSRP                   int64
dtype: object

In [33]:
df.dtypes[df.dtypes == 'object']

Make                 object
Model                object
Transmission Type    object
Vehicle_Style        object
dtype: object

### EDA

In [35]:
df.MSRP.mean()

30186.0

In [36]:
df.MSRP.sum()

150930

In [37]:
df.MSRP.describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: MSRP, dtype: float64

In [39]:
df.Make.nunique()

4

In [40]:
df.Make.value_counts()

Nissan     2
Hyundai    1
Lotus      1
GMC        1
Name: Make, dtype: int64

### Missing values

In [41]:
df.isnull()

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,False,False,False,False,False,False,False,False
1,False,False,False,True,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False

In [42]:
df.isnull().sum()

Make                 0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle_Style        0
MSRP                 0
dtype: int64

In [44]:
df["Engine HP"].fillna(0)

0     138.0
1       0.0
2     218.0
3     194.0
4    2017.0
Name: Engine HP, dtype: float64

In [45]:
df["Engine HP"] = df["Engine HP"].fillna(df["Engine HP"].mean())

In [46]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.00,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,641.75,4,AUTOMATIC,sedan,27150
2,Lotus,Elise,2010,218.00,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.00,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,2017.00,6,MANUAL,Pickup,32340

### Sorting and re-orderingÂ

In [47]:
df.sort_values(by='MSRP')

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.00,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,641.75,4,AUTOMATIC,sedan,27150
4,Nissan,Frontier,2017,2017.00,6,MANUAL,Pickup,32340
3,GMC,Acadia,2017,194.00,4,AUTOMATIC,4dr SUV,34450
2,Lotus,Elise,2010,218.00,4,MANUAL,convertible,54990

In [50]:
df.groupby("Transmission Type").MSRP.mean()

Transmission Type
AUTOMATIC    30800.000000
MANUAL       29776.666667
Name: MSRP, dtype: float64

In [51]:
df.groupby("Transmission Type").MSRP.agg(['mean','count'])

                           mean  count
Transmission Type
AUTOMATIC          30800.000000      2
MANUAL             29776.666667      3